In [2]:
import requests
import pandas as pd

In [74]:
data2019 = requests.get('https://api.census.gov/data/2018/abscs?get=NAME,GEO_ID,NAICS2017_LABEL,SEX,ETH_GROUP,RACE_GROUP,VET_GROUP,FIRMPDEMP&for=state:*&NAICS2017=00&key=a4bcb4614372e8f229066cbce694ccdb6b558ef4').json()

In [55]:
data2020 = requests.get('https://api.census.gov/data/2019/abscs?get=NAME,GEO_ID,NAICS2017_LABEL,SEX,ETH_GROUP,RACE_GROUP,VET_GROUP,FIRMPDEMP&for=state:*&NAICS2017=00&key=a4bcb4614372e8f229066cbce694ccdb6b558ef4').json()

In [48]:
companysummarystate2019 = pd.DataFrame (data[1:], columns= data2019[0])

In [56]:
companysummarystate2020 = pd.DataFrame(data2020[1:], columns = data2020[0])

In [61]:
companysummarystate2019.drop(columns = ['GEO_ID','NAICS2017_LABEL','NAICS2017','state'], inplace=True)

In [62]:
companysummarystate2020.drop(columns = ['GEO_ID','NAICS2017_LABEL','NAICS2017','state'], inplace=True)

In [65]:
companysummarystate2019.head()

          NAME  SEX ETH_GROUP RACE_GROUP VET_GROUP FIRMPDEMP
0  Mississippi  002       029         00       003         0
1  Mississippi  003       029         00       003       466
2  Mississippi  004       029         00       003       572
3  Mississippi  001       001         30       003       926
4  Mississippi  096       096         96       096     37489

In [75]:
companysummarystate2020.head()

          NAME  SEX ETH_GROUP RACE_GROUP VET_GROUP FIRMPDEMP
0  Mississippi  001       028         00       001        93
1  Mississippi  003       028         00       001         0
2  Mississippi  002       029         50       001         0
3  Mississippi  003       029         50       001        51
4  Mississippi  001       001         60       001      2489

In [71]:
companysummarystate2019.FIRMPDEMP.isna().value_counts()

False    9668
Name: FIRMPDEMP, dtype: int64

In [72]:
companysummarystate2020.FIRMPDEMP.isna().value_counts()

False    9641
Name: FIRMPDEMP, dtype: int64

In [76]:
statemerge = companysummarystate2019.merge(companysummarystate2020, on=['NAME', 'SEX', 'ETH_GROUP', 'RACE_GROUP', 'VET_GROUP'], how='inner', suffixes = ('_2019', '_2020') )

The totals for each column are 001, except Race_Group which is 00.
Make sure that you filter for totals on all the other columns except for the ones you are looking at fo

In [77]:
statemerge

,NAME,SEX,ETH_GROUP,RACE_GROUP,VET_GROUP,FIRMPDEMP_2019,FIRMPDEMP_2020
0,Mississippi,003,029,00,003,466,334
1,Mississippi,004,029,00,003,572,0
2,Mississippi,001,001,30,003,926,801
3,Mississippi,096,096,96,096,37489,37057
4,Mississippi,002,001,00,001,6659,7751
...,...,...,...,...,...,...,...
9133,Minnesota,002,029,00,003,0,0
9134,Minnesota,003,029,00,003,941,1128
9135,Minnesota,004,029,00,003,0,1877
9136,Minnesota,001,001,30,003,0,3025
9137,Minnesota,096,096,96,096,105997,105316